from products.Database_class import db

chars = db.chars
views = db.views
titles = db.titles

get_view = db.get_view
get_title = db.get_title

# 输出的文件名集合, 如: 200001_一姬.js
outfile_names = []
for i in range(len(chars)):
    outfile_names.append(str(chars[i]['id']) + "_" + chars[i]['skin'][0]['name'] + ".js")

# 两个正则匹配串
pattern_name = r'editdata\.player_datas\[\d]\.nickname = "(.*)";'
pattern_id = r"editdata\.player_datas\[\d]\.avatar_id = (.*);"

template_title = 'editdata.player_datas[0].title = editdata.player_datas[1].title = editdata.player_datas[2].title = editdata.player_datas[3].title = '
template_verified = 'editdata.player_datas[0].verified = editdata.player_datas[1].verified = editdata.player_datas[2].verified = editdata.player_datas[3].verified = '
template_avatar_frame = 'editdata.player_datas[0].avatar_frame = editdata.player_datas[1].avatar_frame = editdata.player_datas[2].avatar_frame = editdata.player_datas[3].avatar_frame = '
template_views = 'editdata.player_datas[0].views = editdata.player_datas[1].views = editdata.player_datas[2].views = editdata.player_datas[3].views = '
template_title_3P = 'editdata.player_datas[0].title = editdata.player_datas[1].title = editdata.player_datas[2].title = '
template_verified_3P = 'editdata.player_datas[0].verified = editdata.player_datas[1].verified = editdata.player_datas[2].verified = '
template_avatar_frame_3P = 'editdata.player_datas[0].avatar_frame = editdata.player_datas[1].avatar_frame = editdata.player_datas[2].avatar_frame = '
template_views_3P = 'editdata.player_datas[0].views = editdata.player_datas[1].views = editdata.player_datas[2].views = '


def generate_title(title_id, player_num=4):
    temp = template_title
    if player_num != 4:
        temp = template_title_3P
    return '// 称号-' + get_title(title_id)['name'] + '\n' + temp + str(title_id) + ';\n'


def generate_verified(verified, player_num=4):
    temp = template_verified
    if player_num != 4:
        temp = template_verified_3P
    if verified != 1:
        return '// 职业(P标)认证\n' + temp + str(verified) + ';\n'
    return '// 主播(猫爪子)认证\n' + temp + str(verified) + ';\n'


def generate_frame(frame_id, player_num=4):
    temp = template_avatar_frame
    if player_num != 4:
        temp = template_avatar_frame_3P
    return '// ' + get_view(frame_id)['name'] + '\n' + temp + str(frame_id) + ';\n'


def generate_views(slots, item_ids, player_num=4):
    temp = template_views
    if player_num != 4:
        temp = template_views_3P
    result = temp + '[\n'
    for index in range(len(slots)):
        result += ('    {"slot": ' + str(slots[index]) + ', "item_id": ' + str(item_ids[index]) + '}, // ' +
                   get_view(item_ids[index])['name'] + '\n')
    result += '];\n'
    return result


# 对于称号和认证的判定, 限定角色不考虑, 因为限定角色是独立的
# 认证
# 对于明显是"神明"一类的年龄未知的角色: 如
# 一姬, 辉夜姬, 福姬, 青鸾, 琳琅, 汪次郎, 七夕, 加上猫爪子认证
# 姬川响因为本身就是主播, 所以也有猫爪子认证
# 称号
# 一姬有个专属称号"一姬当千"
# 相原舞, 辉夜姬, 汪次郎, 福姬在神社或道馆中, 故有称号"神社贵宾"
# 二阶堂美树和一姬关系很好, 故有称号"喵国大护法"

# 角色专属装扮
char_unique_views = {
    ### 四贵人
    # 西园寺一羽: 和牌-剑吟虎啸; 立直-虎啸长风; 头像框-秋霜切玉
    200052: generate_frame(305529) + generate_views([1, 2, 5], [305215, 305315, 305529]),
    # 北原莉莉: 和牌-银链飞雪; 立直-蛇行诡道; 头像框-圣堂百合
    200061: generate_frame(305537) + generate_views([1, 2, 5], [305219, 305319, 305537]),
    # 东城玄音: 和牌-衔环结草; 立直-狐缘之绊; 头像框-丹心一寸
    200076: generate_frame(305551) + generate_views([1, 2, 5], [305223, 305323, 305551]),
    # 南枫花: 和牌-落羽涅槃; 立直-有凤来仪; 头像框-赤丹霞羽
    200095: generate_frame(30550012) + generate_views([1, 2, 5], [30520006, 30530006, 30550012]),

    ### 联动角色
    # 轻库娘: 立直棒-乘风破浪; 和牌-海浪的馈赠; 立直-浪之声; 桌布-冲鸭！; 牌背-浪花朵朵 (没有专属UP, 都是20年同期活动UP)
    200015: generate_views([0, 1, 2, 6, 7], [305604, 305208, 305308, 305802, 305702]),
    # 宫永照, 原村和, 天江衣, 宫永照: 立直棒-墨西哥卷饼; 和牌-龙卷雷霆; 立直-花天月地; 桌布-赛间小憩; 牌背-艾托企鹅 (天江衣还有"头像框-大小姐发带")
    200034: generate_views([0, 1, 2, 6, 7], [308003, 308001, 308002, 308004, 308005]),
    200035: generate_views([0, 1, 2, 6, 7], [308003, 308001, 308002, 308004, 308005]),
    200036: generate_frame(305552) + generate_views([0, 1, 2, 5, 6, 7],
                                                    [308003, 308001, 308002, 305552, 308004, 308005]),
    200037: generate_views([0, 1, 2, 6, 7], [308003, 308001, 308002, 308004, 308005]),
    # 蛇喰梦子, 早乙女芽亚里, 生志摩妄, 桃喰绮罗莉: 立直棒-生死之剑; 和牌-命运之轮; 立直-纸牌花火; 桌布-无双之花; 牌背-百花境界
    200040: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010]),
    200041: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010]),
    200042: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010]),
    200043: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010]),
    # 赤木茂, 鹫巢岩: 立直棒-命悬一线; 和牌-地狱低语; 立直-幽冥之焰; 桌布-传说之夜;
    200050: generate_views([0, 1, 2, 6, 7], [308013, 308011, 308012, 308014, 308015]),
    200051: generate_views([0, 1, 2, 6, 7], [308013, 308011, 308012, 308014, 308015]),
    # 四宫辉夜, 白银御行, 早坂爱, 白银圭: 立直棒-恋之反省; 和牌-恋之降临; 立直-恋之箭矢; 桌布-恋之见证; 牌背-恋之背影
    200055: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020]),
    200056: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020]),
    200057: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020]),
    200058: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020]),
    # 竹井久, 福路美穗子, 新子憧, 园城寺怜: 立直棒-爱心便当; 和牌-高岭之花; 立直-未来视; 桌布-清凉假日; 牌背-摇曳彩球
    200062: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025]),
    200063: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025]),
    200064: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025]),
    200065: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025]),
    # 鲁鲁修·兰佩洛基, C.C., 枢木朱雀, 红月卡莲: 立直棒-骑士的钥匙; 和牌-绝对的命令; 立直-王者的决意; 桌布-魔女的契约; 牌背-假面的裁决
    200070: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030]),
    200071: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030]),
    200072: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030]),
    200073: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030]),
    # 伊莉雅, 美游, 小黑, 吉尔: 立直棒-红晖的魔杖; 和牌-魔力的迸发; 立直-英灵的典仪; 桌布-星夜的羁绊; 牌背-苍蓝的星辰
    200079: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035]),
    200080: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035]),
    200081: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035]),
    200082: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035]),
    # 砂狼白子, 小鸟游星野, 陆八魔爱露, 浅黄睦月: 立直棒-大蛇比纳; 和牌-冷血射击; 立直-虹色轨迹; 桌布-什亭青空; 牌背-佩洛之星
    200086: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040]),
    200087: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040]),
    200088: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040]),
    200089: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040]),
    # 浅仓透, 樋口圆香, 福丸小糸, 市川雏菜: 立直棒-动听之源; 和牌-涟漪之空; 立直-水漾星光; 桌布-闪耀吧！; 牌背-静谧夜光
    20000100: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007]),
    20000101: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007]),
    20000102: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007]),
    20000103: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007]),
    # 间桐樱, 远坂凛, Saber, Archer: 立直棒-胜利誓约; 和牌-咒层界・恶念祝祭; 立直-虚影祝祷; 桌布-剑之丘; 牌背-噬光之剑
    20000108: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045]),
    20000109: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045]),
    20000110: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045]),
    20000111: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045]),

    ### 常驻角色
    # 一姬: 称号-一姬当千. 猫爪子认证. 立直棒-炎夏型一姬甜筒; 和牌-疾月斩; 立直-猫过留痕; 桌布-吃瓜; 牌面-猫咪雀圣
    200001: generate_title(600045) + generate_verified(1) + generate_views([0, 1, 2, 6, 13],
                                                                           [305049, 305213, 305324, 305046, 305718]),
    # 二阶堂美树: 称号-喵国大护法. 桌布-藤萝悦色
    200002: generate_title(600021) + generate_views([6], [305818]),
    # 藤田佳奈: 桌布-雀魂祭一周年
    200003: generate_views([6], [305048]),
    # 三上千织: 头像框-大小姐发带; 桌布-冲鸭！
    200004: generate_frame(305552) + generate_views([5, 6], [305552, 305802]),
    # 相原舞: 称号-神社贵宾. 桌布-冲鸭！
    200005: generate_title(600038) + generate_views([6], [305804]),
    # 抚子: 桌布-雀魂祭一周年
    200006: generate_views([6], [305048]),
    # 八木唯: 动态桌布-星间飞行
    200007: generate_views([6], [30580007]),
    # 九条璃雨: 动态桌布-捞金鱼
    200008: generate_views([6], [305805]),
    # 泽尼娅: 桌布-小恶魔日记
    200009: generate_views([6], [30580008]),
    # 卡维: 立直棒-陨石法杖; 动态桌布-紫霞海岸
    200010: generate_views([0, 6], [305612, 305809]),
    # 汪次郎: 称号-神社贵宾. 猫爪子认证. 桌布-中光波——————！
    200012: generate_title(600038) + generate_verified(1) + generate_views([6], [305810]),
    # 明智英树: 桌布-中光波——————！
    200014: generate_views([6], [305810]),
    # 二之宫花: 立直棒-盆栽; 头像框-豆芽; 桌布-锦鲤游
    200017: generate_frame(305500) + generate_views([0, 5, 6], [305621, 305500, 305801]),
    # 五十岚阳菜: 头像框-猫咪军团的身份
    200020: generate_frame(305523) + generate_views([5], [305523]),
    # 雏桃: 桌布-贺华岁
    200026: generate_views([6], [305804]),
    # 辉夜姬: 称号-神社贵宾. 猫爪子认证. 桌布-预热开场
    200029: generate_title(600038) + generate_verified(1) + generate_views([6], [30580005]),
    # 艾丽莎: 桌布-预热开场
    200032: generate_views([6], [305803]),
    # 福姬: 称号-神社贵宾. 猫爪子认证
    200038: generate_title(600038) + generate_verified(1),
    # 七夕: 猫爪子认证
    200039: generate_verified(1),
    # 姬川响: 猫爪子认证
    200046: generate_verified(1),
    # 柚: 立直棒-陨石法杖
    200059: generate_views([0], [305612]),
    # 四宫冬实: 桌布-仙境茶话会
    200066: generate_views([6], [305812]),
    # 青鸾: 猫爪子认证
    200067: generate_verified(1),
    # 岚星: 立直棒-秘传之卷; 和牌-天地无用; 立直-毒烟玉
    200074: generate_views([0, 1, 2], [305620, 305222, 305322]),
    # 琳琅: 猫爪子认证
    200084: generate_verified(1),
    # 元宵: 立直棒-青竹伞; 头像框-竹福滚滚; 桌布-清辉竹影; 牌背-翠竹墨影
    20000107: generate_frame(30550022) + generate_views([0, 5, 6, 7], [30560007, 30550022, 30580015, 30570009]),
}

# 三麻部分
char_unique_views_3P = {
    ### 四贵人
    # 西园寺一羽: 和牌-剑吟虎啸; 立直-虎啸长风; 头像框-秋霜切玉
    200052: generate_frame(305529, 3) + generate_views([1, 2, 5], [305215, 305315, 305529], 3),
    # 北原莉莉: 和牌-银链飞雪; 立直-蛇行诡道; 头像框-圣堂百合
    200061: generate_frame(305537, 3) + generate_views([1, 2, 5], [305219, 305319, 305537], 3),
    # 东城玄音: 和牌-衔环结草; 立直-狐缘之绊; 头像框-丹心一寸
    200076: generate_frame(305551, 3) + generate_views([1, 2, 5], [305223, 305323, 305551], 3),
    # 南枫花: 和牌-落羽涅槃; 立直-有凤来仪; 头像框-赤丹霞羽
    200095: generate_frame(30550012, 3) + generate_views([1, 2, 5], [30520006, 30530006, 30550012], 3),

    ### 联动角色
    # 轻库娘: 立直棒-乘风破浪; 和牌-海浪的馈赠; 立直-浪之声; 桌布-冲鸭！; 牌背-浪花朵朵 (没有专属UP, 都是20年同期活动UP, 3)
    200015: generate_views([0, 1, 2, 6, 7], [305604, 305208, 305308, 305802, 305702], 3),
    # 宫永照, 原村和, 天江衣, 宫永照: 立直棒-墨西哥卷饼; 和牌-龙卷雷霆; 立直-花天月地; 桌布-赛间小憩; 牌背-艾托企鹅 (天江衣还有"头像框-大小姐发带", 3)
    200034: generate_views([0, 1, 2, 6, 7], [308003, 308001, 308002, 308004, 308005], 3),
    200035: generate_views([0, 1, 2, 6, 7], [308003, 308001, 308002, 308004, 308005], 3),
    200036: generate_frame(305552, 3) + generate_views([0, 1, 2, 5, 6, 7],
                                                       [308003, 308001, 308002, 305552, 308004, 308005], 3),
    200037: generate_views([0, 1, 2, 6, 7], [308003, 308001, 308002, 308004, 308005], 3),
    # 蛇喰梦子, 早乙女芽亚里, 生志摩妄, 桃喰绮罗莉: 立直棒-生死之剑; 和牌-命运之轮; 立直-纸牌花火; 桌布-无双之花; 牌背-百花境界
    200040: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010], 3),
    200041: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010], 3),
    200042: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010], 3),
    200043: generate_views([0, 1, 2, 6, 7], [308008, 308006, 308007, 308009, 308010], 3),
    # 赤木茂, 鹫巢岩: 立直棒-命悬一线; 和牌-地狱低语; 立直-幽冥之焰; 桌布-传说之夜;
    200050: generate_views([0, 1, 2, 6, 7], [308013, 308011, 308012, 308014, 308015], 3),
    200051: generate_views([0, 1, 2, 6, 7], [308013, 308011, 308012, 308014, 308015], 3),
    # 四宫辉夜, 白银御行, 早坂爱, 白银圭: 立直棒-恋之反省; 和牌-恋之降临; 立直-恋之箭矢; 桌布-恋之见证; 牌背-恋之背影
    200055: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020], 3),
    200056: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020], 3),
    200057: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020], 3),
    200058: generate_views([0, 1, 2, 6, 7], [308018, 308016, 308017, 308019, 308020], 3),
    # 竹井久, 福路美穗子, 新子憧, 园城寺怜: 立直棒-爱心便当; 和牌-高岭之花; 立直-未来视; 桌布-清凉假日; 牌背-摇曳彩球
    200062: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025], 3),
    200063: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025], 3),
    200064: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025], 3),
    200065: generate_views([0, 1, 2, 6, 7], [308023, 308021, 308022, 308024, 308025], 3),
    # 鲁鲁修·兰佩洛基, C.C., 枢木朱雀, 红月卡莲: 立直棒-骑士的钥匙; 和牌-绝对的命令; 立直-王者的决意; 桌布-魔女的契约; 牌背-假面的裁决
    200070: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030], 3),
    200071: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030], 3),
    200072: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030], 3),
    200073: generate_views([0, 1, 2, 6, 7], [308028, 308026, 308027, 308029, 308030], 3),
    # 伊莉雅, 美游, 小黑, 吉尔: 立直棒-红晖的魔杖; 和牌-魔力的迸发; 立直-英灵的典仪; 桌布-星夜的羁绊; 牌背-苍蓝的星辰
    200079: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035], 3),
    200080: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035], 3),
    200081: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035], 3),
    200082: generate_views([0, 1, 2, 6, 7], [308033, 308031, 308032, 308034, 308035], 3),
    # 砂狼白子, 小鸟游星野, 陆八魔爱露, 浅黄睦月: 立直棒-大蛇比纳; 和牌-冷血射击; 立直-虹色轨迹; 桌布-什亭青空; 牌背-佩洛之星
    200086: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040], 3),
    200087: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040], 3),
    200088: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040], 3),
    200089: generate_views([0, 1, 2, 6, 7], [308038, 308036, 308037, 308039, 308040], 3),
    # 浅仓透, 樋口圆香, 福丸小糸, 市川雏菜: 立直棒-动听之源; 和牌-涟漪之空; 立直-水漾星光; 桌布-闪耀吧！; 牌背-静谧夜光
    20000100: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007], 3),
    20000101: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007], 3),
    20000102: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007], 3),
    20000103: generate_views([0, 1, 2, 6, 7], [30560005, 30520007, 30530007, 30580011, 30570007], 3),
    # 间桐樱, 远坂凛, Saber, Archer: 立直棒-胜利誓约; 和牌-咒层界・恶念祝祭; 立直-虚影祝祷; 桌布-剑之丘; 牌背-噬光之剑
    20000108: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045], 3),
    20000109: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045], 3),
    20000110: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045], 3),
    20000111: generate_views([0, 1, 2, 6, 7], [308043, 308041, 308042, 308044, 308045], 3),

    ### 常驻角色
    # 一姬: 称号-一姬当千. 猫爪子认证. 立直棒-炎夏型一姬甜筒; 和牌-疾月斩; 立直-猫过留痕; 桌布-吃瓜; 牌面-猫咪雀圣
    200001: generate_title(600045, 3) + generate_verified(1, 3) + generate_views([0, 1, 2, 6, 13],
                                                                                 [305049, 305213, 305324, 305046,
                                                                                  305718], 3),
    # 二阶堂美树: 称号-喵国大护法. 桌布-藤萝悦色
    200002: generate_title(600021, 3) + generate_views([6], [305818], 3),
    # 藤田佳奈: 桌布-雀魂祭一周年
    200003: generate_views([6], [305048], 3),
    # 三上千织: 头像框-大小姐发带; 桌布-冲鸭！
    200004: generate_frame(305552, 3) + generate_views([5, 6], [305552, 305802], 3),
    # 相原舞: 称号-神社贵宾. 桌布-冲鸭！
    200005: generate_title(600038, 3) + generate_views([6], [305804], 3),
    # 抚子: 桌布-雀魂祭一周年
    200006: generate_views([6], [305048], 3),
    # 八木唯: 动态桌布-星间飞行
    200007: generate_views([6], [30580007], 3),
    # 九条璃雨: 动态桌布-捞金鱼
    200008: generate_views([6], [305805], 3),
    # 泽尼娅: 桌布-小恶魔日记
    200009: generate_views([6], [30580008], 3),
    # 卡维: 立直棒-陨石法杖; 动态桌布-紫霞海岸
    200010: generate_views([0, 6], [305612, 305809], 3),
    # 汪次郎: 称号-神社贵宾. 猫爪子认证. 桌布-中光波——————！
    200012: generate_title(600038, 3) + generate_verified(1, 3) + generate_views([6], [305810], 3),
    # 明智英树: 桌布-中光波——————！
    200014: generate_views([6], [305810], 3),
    # 二之宫花: 立直棒-盆栽; 头像框-豆芽; 桌布-锦鲤游
    200017: generate_frame(305500, 3) + generate_views([0, 5, 6], [305621, 305500, 305801], 3),
    # 五十岚阳菜: 头像框-猫咪军团的身份
    200020: generate_frame(305523, 3) + generate_views([5], [305523], 3),
    # 雏桃: 桌布-贺华岁
    200026: generate_views([6], [305804], 3),
    # 辉夜姬: 称号-神社贵宾. 猫爪子认证. 桌布-预热开场
    200029: generate_title(600038, 3) + generate_verified(1, 3) + generate_views([6], [30580005], 3),
    # 艾丽莎: 桌布-预热开场
    200032: generate_views([6], [305803], 3),
    # 福姬: 称号-神社贵宾. 猫爪子认证
    200038: generate_title(600038, 3) + generate_verified(1, 3),
    # 七夕: 猫爪子认证
    200039: generate_verified(1, 3),
    # 姬川响: 猫爪子认证
    200046: generate_verified(1, 3),
    # 柚: 立直棒-陨石法杖
    200059: generate_views([0], [305612], 3),
    # 青鸾: 猫爪子认证
    200066: generate_verified(1, 3),
    # 四宫冬实: 桌布-仙境茶话会
    200067: generate_views([6], [305812], 3),
    # 岚星: 立直棒-秘传之卷; 和牌-天地无用; 立直-毒烟玉
    200074: generate_views([0, 1, 2], [305620, 305222, 305322], 3),
    # 琳琅: 猫爪子认证
    200084: generate_verified(1, 3),
    # 元宵: 立直棒-青竹伞; 头像框-竹福滚滚; 桌布-清辉竹影; 牌背-翠竹墨影
    20000107: generate_frame(30550022, 3) + generate_views([0, 5, 6, 7], [30560007, 30550022, 30580015, 30570009], 3),
}
